return function(map, characterManager, enemyManager)
  local chara = characterManager:getCurrentCharacter():getName()
  --ステージセレクト時
return {
    "わかれみちだ　どうする？",
    "みちがふたつに　わかれている",
    "わかれみち　みたいね",
    "つぎのステージをえらんでね",
    "-STAGE SELECT-",
    "うんめいの　せんたく",
    "いま　せんたくの　とき",
    "いよいよもって　えらぶがよい",
    "おまえには　すすむべき　ふたつのみちがある",
    "ど　ち　ら　に　い　こ　う　か　な",
    "じんせいの　きろに　たたされている",
    "えらんだら　あともどり　できないぜ",
    "こういうときこそ　しんちょうに",
    "どっちにすすもうか",
    "すきなほうに　すすもう",
    "ひだりのほうが　かんたんだよ",
    "EASY かんたん　HARD むずかしい",
    "わかれみち　みぎにいくほど　むずかしいよ",
    "あなたに　せんたくを　ゆだねるわ",
  }
  ]]
end