return function(map, characterManager, enemyManager)
  local chara = characterManager:getCurrentCharacter():getName()
  --ＭＰが足りずコマンドをミスった時
return {
    "しかし　まりょくが　たりない",
    "まほうは　ふはつに　おわった",
    "ここで　つうこんの　まりょくぶそく！",
    "ちょっと　オクス　まりょくがもうないわ！",
    "かいふく　しないと　だせない",
    "まりょくゼロ！オクスに　こうたい　しよう",
    "まりょくが　たりないとは　なさけない",
    "まりょくを　かいふく　しないと！",
    "はやく　まりょくを　かいふくするのよ！",
    "まりょくぶそくだ！　なんてこった",
    "わーお　まりょくが　たりない!",
    "なぜ　まほうがでない！？　MPぎれか！",
    "まりょくぎれ！？　大ピンチ！",
    "オクス！MPチャージをつかって！",
    "まりょくが　きれたーーーー！？",
    "もぉ　つかえないよぉ"
  }
end