return function(map, characterManager, enemyManager)
  local chara = characterManager:getCurrentCharacter():getName()
  --ＱＴＥ攻撃時
return {
    "とどめだー　くらえー",
    "オクス！　れんぞくこうげきよ",
    "ファイナル　アタック！！",
    "とどめだっ！",
    "とどめよっ！！",
    "うぉぉぉおおお",
    "オクス！　いまよ！",
    "いくぜ　ひっさつ！！",
    "オクスの　れんぞくけん！",
    "がったいこうげき！　まほうけん",
    "もうひといきじゃ！",
    "おりゃぁあああ！",
    "わたしも　しえんするわ！",
    "ズバズバズバズバズバ！！",
    "きりきざむぜ！れんぞくけん！！",
    "いっきに　きめる！！！！",
    "ここで　だめおし！",
    "おらおらおらおらおらー",
    "アタタタタタタタ！",
    "めったぎりに　するぜっ！！",
  }
end