--[[
 スキルトリガーの配置データ
 x : x座標の配置データを持たせてください
 y : y座標
 scale : トリガーの大きさ0~1
 rotation : トリガーの回転角 0~360
 ]]--

Type0 = { -- 初期バージョン
  x = {51.0, 50.0, 101, 110.0, 357, 385, 437, 410.2},
  y = {52.2, 114.2, 100.5, 52, 52, 97, 97, 52.0},
  scale = {1.0, 0.75, 0.75, 0.75, 0.75, 0.75, 0.75, 0.75},
  rotation = {45.0, 45.0, 45.0, 45.0, 90, 90, 90, 90}
}

Type1 = { -- 横に配置バージョン
  x = {42, 42, 42, 42, 445, 445, 445, 445},
  y = {42, 110, 175, 240, 35, 100, 165, 230},
  scale = {0.40, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35},
  rotation = {0, 0, 0, 0, 0, 0, 0, 0}
}

return Type0 -- 採用する配置タイプを返してください