function getColor(hp)
  -- RGBを返すように実装してください
  local colors = {
    {255, 255, 255},
    {255, 253, 139},
    {255, 238, 17 },
    {101, 255, 183},
    {97,  255, 37 },
    {8, 255, 135  },
    {102, 157, 255},
    {0, 136, 238  },
    {17,  106, 255},
    {0, 87,  176  },
    {84,  0, 244  },
    {0, 0, 182    },
    {0, 120, 155  },
    {137, 137, 137},
    {0, 176, 117  },
    {0, 182, 2    },
    {0, 123, 0    },
    {112, 128, 0  },
    {159, 120, 0  },
    {126, 57,  0  },
    {117, 0, 0    },
    {178, 0, 0    },
    {255, 102, 162},
    {255, 53,  247},
    {148, 41,  255},
    {255, 48,  6  },
    {255, 39,  75 },
    {137, 0, 140  },
    {87,  0, 159  },
    {140, 0, 87   },
  }
  if hp == 0 then -- HPが0のとき
    return 255, 255, 255 -- 強制的に白を返します
  end
  local key = math.ceil(hp / 3) -- 3で割って切り上げます
  local length = #colors -- 長さをとります
  key = math.min(length, key) -- keyが長さ以上の時、バグるのでkeyを最大値にします
  return colors[key][1], colors[key][2], colors[key][3] -- key番目のr, g, bを1こずつ返します
end
